Autodesk.Revit.UI.EditorInteractionType
Defines the type of interactions a pane has with the active editor when it becomes active in the Revit UI.
Since:
2017
Since:
2017

Autodesk.Revit.UI.EditorInteractionType.KeepAlive
Keeps the active editor alive during pane activation.
This results in the current selection being kept active and available to the pane.
One example built-in dockable pane that uses this mode is the Revit Property Palette.

Autodesk.Revit.UI.EditorInteractionType.Dismiss
Dismiss the active editor during pane activation.
This results in the current selection being cleared and the editor canceled.
One example built-in dockable pane that uses this mode is the Revit Project Browser.